{
  "home": "Home",
  "skills": "Skills",
  "portfolio": "Portfolio",
  "contact": "Contact",

  "bannerTitle": "I'm <span class='highlight'>Bárbara Azevedo</span>,<br><span class='highlight'>a Software Development</span> Intern.",
  "bannerDescription": "I'm specializing in front-end to build modern and responsive web applications, while expanding my knowledge  in  back-end  with  the  goal  of  becoming a full-stack developer.",
  "resume": "Resume",
  "connect": "Connect on LinkedIn",
  "scroll-button": "Scroll Down",

  "skills-title": "Skills",
  "hard-skills-title": "Hard Skills",
  "soft-skills-title": "Soft Skills",
  "soft-card-communication": "Communication",
  "soft-card-detail": "Attention to Detail",
  "soft-card-teamwork": "Teamwork",
  "soft-card-proactivity": "Proactivity",
  "soft-card-adaptability": "Adaptability",
  "soft-card-user": "User-Centered Mindset",

  "portfolio-title": "Portfolio",
  "view-more": "View More",
  "btn-project": "Project",
  "btn-repository": "Repository",
  "guess-subtitle": "Guess my Number",
  "guess-description": "A simple game built with JavaScript where you must guess a secret number randomly generated. Use the hints given by the game to get closer to the correct answer. Good luck — may the odds be ever in your favor!",
  "guess-date": "August 1st, 2024",
  "pig-game-description": "A fun and strategic multiplayer dice game! In Pig Game Dice, two players take turns rolling a die to accumulate points. On each turn, a player can choose to keep rolling to add more points or hold to save their current score and pass the turn. But watch out: if you roll a 1, you lose all the points for that round! The first player to reach the final target score wins the game. Perfect for testing your luck, strategy, and knowing when to stop!",
  "pig-game-date": "August 15, 2024",
  "mold-description": "Institutional website for a ceramics brand. This project was developed to practice and demonstrate HTML, CSS, and JavaScript skills. The website was created for a fictional ceramics company to strengthen its online presence, boost sales, and foster creative partnerships with restaurants. The responsive layout, interactive effects, and fluid navigation reflect good front-end practices and a focus on user experience.",
  "mold-date": "July 22, 2024",
  "cinetag-description": "Interactive Web Application with React. A project built with React to explore key concepts such as componentization, routing, and global state management. The app allows users to browse a video gallery, watch each video on a dedicated player page, and manage a personalized list of favorite videos. This project emphasizes clean architecture, responsive design, and a seamless user experience — demonstrating strong front-end development skills.",
  "cinetag-date": "May 31, 2025",
  "organo-description": "Team Member Registration Web App – Start DB. This project was built with React for the Start DB program. It allows users to register and display team member cards, organized by unit. The interface includes a dynamic form where users can input each member’s name, role, image, and unit. The project demonstrates solid knowledge of component-based architecture, shared state handling, and dynamic form management, all within a clean and responsive design.",
  "organo-date": "May 16, 2025",
  "bethefriend-description": "Social Network to Support Seniors. A web application designed with a social impact focus, connecting seniors in need with volunteers willing to help. The platform enables user registration, posting of help requests, direct communication, and profile management—organized by location and user type. This project highlights skills in authentication, dynamic filtering, usability, and full-stack application architecture.",
  "bethefriend-date": "December 16, 2024",
  "leno-description": "Landing Page for Mobile App. A conversion-focused website designed to showcase the app’s main features, engage potential users, and drive downloads. The layout includes product details, user testimonials, and space for an explainer video. This project was developed during the UDEMY - Modern HTML & CSS (2024) course, emphasizing responsive design, modern aesthetics, and front-end best practices.",
  "leno-date": "July 5th, 2024",
  "lumina-description": "Showcase Website for Design and Photography Agency. Lumina is a clean and elegant website designed to highlight a creative agency’s visual portfolio. Featuring an immersive gallery and minimalist layout, the project emphasizes creativity, style, and professionalism through visuals. Built with a focus on modern aesthetics and strong visual impact.",
  "lumina-date": "September 3rd, 2024",
  "library-components-description": "React Library Components. A React component library focused on reusability and consistent styling. It includes variations of buttons (CTA and step), links, two types of modals, a stepper form, titles (with five styles), a to-do list, and a rating component. Features theme switching via Context API (light, dark, and purple) and automated tests with Jest. Developed during the front-end mentorship of DB Server’s internship program, mentored by Felipe Christofoli.",
  "library-components-date": "July 16, 2025",

  "get-in-touch": "Get in touch",
  "placeholder-name": "Your name",
  "placeholder-email": "Your e-mail",
  "placeholder-subject": "Subject",
  "placeholder-message": "Type a message",
  "send-message": "Send",

  "circule-text-center": "Hire me",
  "circule-text": "• Software • Developer • Intern",

  "footer-title": "Portfolio • Bárbara Azevedo",
  "footer-subtitle": "Living, learning and leveling up everyday.",
  "footer-paragraph": "Copyright © Bárbara Azevedo - All rights reserved"
}
