{
  "home": "Início",
  "skills": "Habilidades",
  "portfolio": "Portfólio",
  "contact": "Contato",

  "bannerTitle": "Sou <span class='highlight'>Bárbara Azevedo</span>,<br> estagiária <span class='highlight'>Desenvolvedora de Software</span>",
  "bannerDescription": "Estou me especializando em front-end para construir aplicações web modernas e responsivas, enquanto expando meus conhecimentos em back-end, com o objetivo de me tornar uma desenvolvedora full stack.",
  "resume": "Currículo",
  "connect": "Conectar no LinkedIn",
  "scroll-button": "Explore abaixo",

  "skills-title": "Habilidades",
  "hard-skills-title": "Competências técnicas",
  "soft-skills-title": "Competências Interpessoais",
  "soft-card-communication": "Comunicação",
  "soft-card-detail": "Atenção aos detalhes",
  "soft-card-teamwork": "Trabalho em equipe",
  "soft-card-proactivity": "Proatividade",
  "soft-card-adaptability": "Adaptabilidade",
  "soft-card-user": "Foco no usuário",

  "portfolio-title": "Portfólio",
  "view-more": "Saiba mais",
  "btn-project": "Projeto",
  "btn-repository": "Repositório",
  "guess-description": "Um jogo simples desenvolvido com JavaScript em que você precisa adivinhar um número secreto gerado aleatoriamente. Use as dicas fornecidas pelo jogo para chegar o mais perto possível da resposta correta. Boa sorte — que a sorte esteja sempre a seu favor!",
  "guess-date": "01 de agosto de 2024",
  "pig-game-description": "Um jogo de dados multiplayer divertido e estratégico! No Pig Game Dice, dois jogadores se revezam lançando um dado para acumular pontos. A cada rodada, o jogador pode continuar jogando para somar mais pontos ou decidir segurar (hold) sua pontuação atual, passando a vez para o oponente. Mas cuidado: se sair o número 1 no dado, o jogador perde todos os pontos daquela rodada! Ganha quem alcançar primeiro a pontuação final definida. Ideal para testar sua sorte, estratégia e habilidade de saber a hora certa de parar!",
  "pig-game-date": "15 de agosto de 2024",
  "mold-description": "Site institucional para marca de cerâmica. Projeto desenvolvido para praticar e demonstrar habilidades em HTML, CSS e JavaScript. O site foi criado para uma empresa fictícia de cerâmica com o objetivo de fortalecer sua presença online, impulsionar as vendas e promover parcerias criativas com restaurantes. O layout responsivo, os efeitos de interação e a navegação fluida refletem boas práticas de front-end e foco em experiência do usuário.",
  "mold-date": "22 de julho de 2024",
  "cinetag-description": "Aplicação web interativa com React. Projeto desenvolvido com React para explorar conceitos de componentização, roteamento e gerenciamento de estado global. A aplicação permite que os usuários naveguem por uma galeria de vídeos, assistam a cada conteúdo em uma página dedicada com player integrado e adicionem seus vídeos favoritos a uma lista personalizada. Essa solução foca em proporcionar uma experiência de navegação fluida e responsiva, com ênfase na organização do código e boas práticas em front-end.",
  "cinetag-date": "31 de maio de 2025",
  "organo-description": "Aplicação web para cadastro de integrantes - Start DB. Projeto desenvolvido com React para o programa Start DB, com o objetivo de registrar e exibir cartões de membros organizados por unidade. A interface conta com um formulário dinâmico que permite ao usuário inserir nome, cargo, imagem e unidade de cada integrante. O projeto reforça conceitos de componentização, estado compartilhado e manipulação de formulários, resultando em uma aplicação funcional, organizada e com design responsivo.",
  "organo-date": "16 de maio de 2025",
  "bethefriend-description": "Rede Social de Apoio a Idosos. Aplicação web desenvolvida com foco em impacto social, conectando idosos que precisam de ajuda com voluntários dispostos a colaborar. A plataforma permite cadastro de usuários, publicação de pedidos de ajuda, comunicação entre participantes e gerenciamento de perfis, tudo organizado por localização e tipo de usuário. O projeto destaca habilidades em autenticação, filtros dinâmicos, usabilidade e arquitetura de aplicações completas.",
  "bethefriend-date": "16 de dezembro de 2024",
  "leno-description": "Landing Page para Aplicativo Mobile. Site desenvolvido com foco em conversão, apresentando os principais benefícios do aplicativo para atrair novos usuários e incentivar o download. A interface inclui detalhes sobre o produto, depoimentos de usuários e espaço para vídeo explicativo. Projeto criado durante o curso UDEMY - Modern HTML & CSS (2024), com ênfase em responsividade, design moderno e boas práticas de desenvolvimento front-end.",
  "leno-date": "05 de julho de 2024",
  "lumina-description": "Site institucional para agência de design e fotografia. Lumina é um site simples e elegante criado para destacar o portfólio visual de uma agência de design e fotografia. Com uma galeria imersiva e layout limpo, o projeto transmite criatividade, estilo e profissionalismo. Desenvolvido com foco na estética moderna e na valorização das imagens.",
  "lumina-date": "03 Setembro de 2024",
  "library-components-description": "React Library Components. Biblioteca de componentes React com foco em reutilização e estilo consistente. Inclui variações de botões (CTA e step), links, dois tipos de modais, formulário stepper, títulos (com cinco variações), to-do list e componente de avaliação (rating). Possui sistema de temas via Context API (light, dark e purple) e testes automatizados com Jest. Desenvolvido durante a mentoria de front-end do programa de estágio da DB Server, orientado por Felipe Christofoli.",
  "library-components-date": "16 de Julho de 2025",


  "get-in-touch": "Contato",
  "placeholder-name": "Seu nome",
  "placeholder-email": "Seu e-mail",
  "placeholder-subject": "Assunto",
  "placeholder-message": "Digite uma mensagem",
  "send-message": "Enviar",

  "circule-text-center": "Contrate",
  "circule-text": "• Developer •Software • Júnior",

  "footer-title": "Portfólio • Bárbara Azevedo",
  "footer-subtitle": "Vivendo, aprendendo e evoluindo todos os dias.",
  "footer-paragraph": "Copyright © Bárbara Azevedo - Todos os direitos reservados"
}
